{"intents" : [

    {"tag":"greetings", 
    "patterns": ["hello", "hey", "greeting", "good day", "hi"], 
    "responses":  ["Hello!", "Hey!"]
},
{"tag": "goodmorning", 
"patterns": ["goodmorning", "good morning"], 
"responses": ["Good morning!"]
},
{"tag": "Thanks", 
"patterns": ["Thanks", "Thank you"], 
"responses": ["No problem!", "You're welcome!"]
},
{"tag": "have a good day", 
"patterns": ["have a good night", "have a good day"], 
"responses": ["Thank you! You too."]
},
{"tag": "goodbye", 
"patterns": ["ciao", "goodbye", "night night", "bye"], 
"responses": ["Ciao", "Goodbye", "Bye"]
},
{"tag":"feelng", 
"patterns": ["how do you feel", "how are you?", "how's everything?"], 
"responses":  ["Everything is great! How are you?"]
},
{"tag":"user's feeling", 
"patterns": ["I'm good", "i'm great", "i'm fine", "everything is ok"], 
"responses":  ["Fantastic! How can I help you today?"]
},
{"tag":"name", 
"patterns": ["what's your name?", "who are you"], 
"responses":  ["My name is Atlas, a language model created by team AF"]
},
{"tag": "age", 
"patterns": ["how old is york university?"], 
"responses": ["York is about 64 years old, and York university Library has been open since then."]
},
{"tag":"color", 
"patterns": ["what's your favorite color"], 
"responses":  ["My favorite color is red, as York University's logo is."]
},
{"tag":"hobbies", 
"patterns": ["what are your hobbies"], 
"responses":  ["I'm a language model developed by team AF, my objective is to help individuals enhance their navigation experiences through seamless assistance and guidance."]
},


{"tag":"Group AF", 
"patterns": ["what are the members of group af"], 
"responses":  ["We are York University students. Raha, Morsal, Jasdeep, Ima, Paola, Jay, Jabril, Anita."]
},
{"tag":"team AF", 
"patterns": ["tell me about team AF", "what do members of team AF do"], 
"responses":  ["Our comprehensive team comprises experts with diverse backgrounds and majors, including software engineering, civil engineering, geography, space engineering, art and media, finance, and biology."]
},
{"tag":"abbreviation", 
"patterns": ["what does Atlas stand for"], 
"responses":  ["Atlas stands for Automated Text Library Assistace System."]
},
{"tag":"Job", 
"patterns": ["what do you do?", "what do you do for living"], 
"responses":  ["I optimize the user navigation experience on the York Library website."]
},
{"tag":"work", 
"patterns": ["what is team AF working on", "what is team AF's final goal", "what is team AF's project"], 
"responses":  ["Team AF's project is about enhacing the York University library website, to make it easier to use, navigate, and fun to check "]
},
{"tag":"York", 
"patterns": ["is york good?", "what is the best university", "what univeristy has the best library"], 
"responses":  ["York University is distinguished by its diverse programs, inclusive community, notable research emphasis, and boasts one of the best libraries, offering a comprehensive and enriching educational experience with valuable real-world exposure.."]
},


{"tag":"work time", 
"patterns": ["when is the library open", "When does the library close today", "What are the library's hours on weekends?", "Can you tell me the operating hours for tomorrow?", "Is the library currently open?"], 
"responses":  ["Scott library is open 10am - 7pm on weekdays, 11am-4pm on Saturday, and 2pm - 7pm on Sunday. For more information visit https://www.library.yorku.ca/web/hours-and-locations/ "]
},
{"tag": "exam period", 
"patterns": ["Are there any extended hours for exam periods?"], 
"responses": ["Yes, during exam periods, the library often has extended hours. It's recommended to check the library's website on https://www.library.yorku.ca/web/hours-and-locations/ or contact them for specific information on extended hours during exams."]
},
{"tag":"reservation", 
"patterns": ["How can I reserve a studying space at the library?", "Can I reserve a studying space for a group?"], 
"responses":  ["To reserve a studying space, you can either use our online reservation system on https://www.library.yorku.ca/web/ask-services/book-a-study-seatspace-at-the-libraries/ or visit the library's front desk."]
},
{"tag":"limit for reservation", 
"patterns": ["Is there a limit to how long I can reserve a studying space?", "Are there any restrictions on reserving studying spaces?"], 
"responses":  ["Study space reservation times may vary. You can check https://www.library.yorku.ca/web/ask-services/book-a-study-seatspace-at-the-libraries/ for more information"]
},
{"tag":"cancelling reservation", 
"patterns": ["How do I cancel a studying space reservation?"], 
"responses":  ["You can usually cancel a reservation through the library's online reservation system on https://www.library.yorku.ca/web/ask-services/book-a-study-seatspace-at-the-libraries/ or by contacting the library's staff."]
},
{"tag":"changing time slot", 
"patterns": ["Can I change my reserved studying space to a different time slot?"], 
"responses":  ["In many cases, you can modify your reservation through the library's online system on https://www.library.yorku.ca/web/ask-services/book-a-study-seatspace-at-the-libraries/ , provided that there's availability for the new time slot."]
},

{"tag":"Locations", 
"patterns": ["where is scott library", "where is the location of all libraries"], 
"responses":  ["Scott library is at scott building, in 4700 Keele Street. For more information visit https://www.library.yorku.ca/web/locations-and-spaces/library-and-archives-locations/."]
},

{"tag":"Workshops", 
"patterns": ["how can i access workshop information"], 
"responses":  ["To find information about workshops, visit this link https://yorku.libcal.com/calendar/libraryworkshops?cid=7880&t=d&d=0000-00-00&cal=7880&inc=0 ."]
},

{"tag":"contact", 
"patterns": ["how can i contact York"], 
"responses":  ["You can visit this website for contact information, https://www.library.yorku.ca/web/about-us/contact-us/ "]
},

{"tag":"finding a book", 
"patterns": ["how can i find a book", "how can i find a article", "how can i find a reserves"], 
"responses":  ["You can use the library's online catalog to search for specific books by title, author, or keywords. The catalog will show you the availability and location of the book."]
},
{"tag":"personal account", 
"patterns": ["Do i need to have a personal account to use accomodations"], 
"responses":  ["If you are a York student, you can log in with Passport York, otherwise you need to authenticate using the barcode number on their library card and password."]
},
{"tag":"library card", 
"patterns": ["how can i get my library card"], 
"responses":  ["You can visit this website for contact information, https://www.library.yorku.ca/web/about-us/contact-us/ or visit the library's front desk."]
},
{"tag":"academic integrity", 
"patterns": ["how can i find information about academic integrity"], 
"responses":  ["You can visit the following website for information on academic integrity, https://www.library.yorku.ca/web/research-learn/citing-your-work-academic-integrity/academic-integrity/"]
},
{"tag":"citation tools", 
"patterns": ["how can i find information about citation tools"], 
"responses":  ["You can find information about citation tool on https://www.library.yorku.ca/web/research-learn/citing-your-work-academic-integrity/citations/ ."]
},
{"tag":"citing work", 
"patterns": ["how can i find information about citation", "how can i find information about citing a work", "information about citation"], 
"responses":  ["You can find information about citation on https://researchguides.library.yorku.ca/styleguides ."]
},

{"tag":"expression", 
"patterns": ["wow", "cool", "nice", "interesting"], 
"responses":  ["Let me know if you have any furthur questions!"]
},

{"tag": "library-research",
"patterns": ["How can I access research databases?", "Tell me about research databases"],
"responses": ["You can access research databases through the library's website. These databases provide access to scholarly articles, journals, and other academic resources."]
},

{"tag": "library-subject-guides",
"patterns": ["What are subject guides and how can they help me?", "Tell me about subject guides"],
"responses": ["Subject guides are curated lists of resources, databases, and research tips tailored to specific subjects or topics. They can help you navigate through relevant materials for your research."]
},
{"tag": "library-exhibitions",
"patterns": ["Are there any ongoing library exhibitions?", "Tell me about library exhibitions"],
"responses": ["Yes, libraries often host exhibitions showcasing special collections, artwork, or historical artifacts. You can find information about ongoing exhibitions on the library's website or at the library itself."]
},
{"tag": "library-fines",
"patterns": ["What are the consequences of returning items late?", "Tell me about library fines"],
"responses": ["Returning items late can result in overdue fines. The amount of the fine depends on the type of material and the duration it's overdue. It's a good idea to return items on time to avoid fines."]
},
{"tag": "library-technology",
"patterns": ["Are there computers and Wi-Fi available at the library?", "Tell me about library technology"],
"responses": ["Yes, libraries usually provide computers with internet access and Wi-Fi for users. These resources are valuable for research, studying, and accessing online materials."]
},
{"tag": "library-feedback",
"patterns": ["How can I provide feedback about the library's services?", "Tell me about giving feedback"],
"responses": ["Your feedback is important! Many libraries have feedback mechanisms like suggestion boxes, surveys, or online forms where you can share your thoughts about the library's services."]
},
{"tag": "library-social-media",
"patterns": ["Does the library have a presence on social media?", "Tell me about library social media"],
"responses": ["Yes, libraries often have social media accounts where they share updates, events, resources, and interact with users. You can follow them on platforms like Facebook, Twitter, or Instagram."]
},
{"tag": "library-archives",
"patterns": ["Are there archives or special collections in the library?", "Tell me about library archives"],
"responses": ["Many libraries have archives or special collections that house rare books, historical documents, manuscripts, and other unique materials. These collections are often valuable for research and exploration."]
},
{"tag": "library-multimedia",
"patterns": ["Can I borrow multimedia materials like DVDs or CDs from the library?", "Tell me about borrowing multimedia"],
"responses": ["Yes, libraries often have multimedia collections that include DVDs, CDs, and other audiovisual materials. You can borrow these materials like you would with books."]
},
{"tag": "library-remote-help",
"patterns": ["Is there remote help available for using library resources?", "Tell me about remote assistance"],
"responses": ["Absolutely! Libraries offer remote assistance through chat services, email, or online consultations. This way, you can get help with your research and inquiries even when you're not on campus."]
},
{"tag": "library-parking",
"patterns": ["Is there parking available at the library?", "Tell me about library parking"],
"responses": ["Yes, York has parking facilities available for users. You can find information about parking availability, fees, and locations on the library's website on https://www.yorku.ca/parking/ or by contacting staff."]
},
{"tag": "library-student-support",
"patterns": ["Are there resources to help students with their academic needs?", "Tell me about student support"],
"responses": ["Yes, libraries offer various resources to support students' academic needs. This might include workshops, writing centers, tutoring services, and more. For more information check https://www.library.yorku.ca/web/ask-services/"]
},
{"tag": "library-career-services",
"patterns": ["Does the library offer resources for career development?", "Tell me about career services"],
"responses": ["Yes, libraries have resources related to career development, such as resume-building workshops, job search assistance, and access to career-related databases."]
},
{"tag": "library-quiet-hours",
"patterns": ["When are the library's quiet hours?", "Tell me about quiet hours"],
"responses": ["Libraries typically have designated quiet hours or zones where users can focus and study without disturbances. You can check the library's website or ask staff for information about quiet hours."]
},
{"tag": "library-volunteer",
"patterns": ["Can I volunteer at the library?", "Tell me about library volunteering"],
"responses": ["Yes, libraries offer volunteering opportunities for students and community members. Volunteering might involve assisting with events, workshops, or shelving materials."]
},
{"tag": "library-printing-options",
"patterns": ["Can I print in color at the library?", "Tell me about printing options"],
"responses": ["Yes, libraries often offer both black-and-white and color printing options. Printing costs for color prints might be higher than for black-and-white."]
},
{"tag": "library-loan-renewal",
"patterns": ["Can I renew my borrowed items online?", "Tell me about renewal process"],
"responses": ["Yes, you can often renew your borrowed items online through your library account. Renewal periods might vary depending on the type of material."]
},
{"tag": "library-alumni-access",
"patterns": ["Can alumni use library resources?", "Tell me about alumni access"],
"responses": ["libraries offer limited access to their resources for alumni, such as borrowing privileges, database access, or in-person services. Alumni can inquire about available services and policies."]
},
{"tag": "library-international-students",
"patterns": ["Are there resources for international students at the library?", "Tell me about resources for international students"],
"responses": ["Yes, libraries provide resources to support international students' academic and cultural integration, including language assistance, orientation materials, and cross-cultural workshops."]}
 

]}
